{
  "Afghanistan": {
    "recipes": [
      {
        "name": "Kabuli Pulao",
        "description": "A flavorful Afghan rice dish made with lamb or beef, raisins, and carrots.",
        "ingredients": [
          "2 cups basmati rice",
          "1 pound lamb or beef, cubed",
          "1 onion, chopped",
          "1/2 cup raisins",
          "2 carrots, chopped",
          "1 tablespoon vegetable oil",
          "2 cups water",
          "1/2 teaspoon salt"
        ],
        "instructions": [
          "In a large pot, heat the oil over medium heat. Add the onion and cook until translucent.",
          "Add the meat and cook until browned on all sides.",
          "Add the rice, water, and salt. Bring to a boil.",
          "Reduce heat to low and cover the pot. Simmer for 20 minutes.",
          "Add the raisins and carrots to the pot, and stir gently.",
          "Cover the pot again and simmer for another 10-15 minutes, or until the rice is tender and the liquid has been absorbed.",
          "Serve hot."
        ]
      },
      {
        "name": "Bolani",
        "description": "A traditional Afghan flatbread filled with mashed potatoes, onions, and spices.",
        "ingredients": [
          "2 cups all-purpose flour",
          "1/2 cup water",
          "1/2 teaspoon salt",
          "2 cups mashed potatoes",
          "1 onion, chopped",
          "1/4 cup fresh cilantro, chopped",
          "1/2 teaspoon ground cumin",
          "1/2 teaspoon ground coriander",
          "1/4 teaspoon cayenne pepper",
          "Vegetable oil, for frying"
        ],
        "instructions": [
          "In a large bowl, mix together the flour, water, and salt to form a dough.",
          "Cover the bowl with plastic wrap and let the dough rest for 30 minutes.",
          "In a separate bowl, mix together the mashed potatoes, onion, cilantro, cumin, coriander, and cayenne pepper.",
          "Divide the dough into 8 equal pieces and roll each piece into a thin circle on a lightly floured surface.",
          "Spread a few tablespoons of the potato mixture onto one half of each circle, leaving a small border around the edge.",
          "Fold the other half of the dough over the filling and pinch the edges together to seal.",
          "In a large skillet, heat about 1/2 inch of vegetable oil over medium-high heat.",
          "Fry each bolani for 2-3 minutes on each side, or until golden brown and crispy.",
          "Drain on a paper towel-lined plate and serve hot."
        ]
      }
    ]
  },
  "Albania": {
    "recipes": [
      {
        "name": "Byrek",
        "description": "A savory Albanian pie made with phyllo dough, spinach, and feta cheese.",
        "ingredients": [
          "1 package phyllo dough",
          "1 pound fresh spinach, chopped",
          "1 onion, chopped",
          "1/2 cup crumbled feta cheese",
          "1/2 cup olive oil",
          "1/2 teaspoon salt",
          "1/4 teaspoon black pepper"
        ],
        "instructions": [
          "Preheat the oven to 375°F (190°C).",
          "In a large skillet, heat the olive oil over medium heat. Add the onion and cook until translucent.",
          "Add the spinach to the skillet and cook until wilted. Season with salt and black pepper.",
          "Remove the skillet from heat and stir in the feta cheese.",
          "Brush a baking dish with olive oil.",
          "Lay one sheet of phyllo dough in the dish and brush it with olive oil. Repeat with 5 more sheets of phyllo dough.",
          "Spread the spinach mixture over the phyllo dough.",
          "Layer 6 more sheets of phyllo dough on top, brushing each sheet with olive oil.",
          "Bake in the preheated oven for 30-40 minutes, or until the phyllo dough is golden brown and crispy.",
          "Cut into squares and serve hot."
        ]
      },
      {
        "name": "Tave Kosi",
        "description": "A delicious Albanian lamb and yogurt casserole with a custard-like topping.",
        "ingredients": [
          "1 pound lamb, cut into small pieces",
          "2 cups plain yogurt",
          "4 eggs",
          "1/4 cup rice flour",
          "1/4 cup butter, melted",
          "1/4 teaspoon salt",
          "1/4 teaspoon black pepper",
          "1/4 teaspoon ground cinnamon"
        ],
        "instructions": [
          "Preheat the oven to 375°F (190°C).",
          "In a large skillet, cook the lamb over medium heat until browned on all sides.",
          "Transfer the lamb to a baking dish.",
          "In a bowl, mix together the yogurt, eggs, rice flour, melted butter, salt, black pepper, and cinnamon.",
          "Pour the yogurt mixture over the lamb in the baking dish.",
          "Bake in the preheated oven for 45-50 minutes, or until the custard-like topping is golden brown and set.",
          "Serve hot."
        ]
      }
    ]
  },
  "Algeria": {
    "recipes": [
      {
        "name": "Couscous",
        "description": "A traditional dish made of semolina, meat and vegetables.",
        "ingredients": [
          "1 lb lamb or chicken",
          "1 onion, chopped",
          "2 cloves garlic, minced",
          "2 carrots, chopped",
          "2 zucchinis, chopped",
          "1 cup chickpeas",
          "2 cups couscous",
          "2 cups water",
          "2 tbsp olive oil",
          "Salt and pepper, to taste"
        ],
        "instructions": [
          "Heat the olive oil in a large pot over medium heat.",
          "Add the onion and garlic and sauté for 2-3 minutes, until soft.",
          "Add the lamb or chicken and cook until browned on all sides.",
          "Add the vegetables, chickpeas, salt, and pepper, and cook for 5-10 minutes.",
          "Add the water and bring to a boil.",
          "Add the couscous to the pot and stir to combine.",
          "Cover the pot and let it simmer for 10-15 minutes, until the couscous is cooked and the liquid has been absorbed.",
          "Fluff the couscous with a fork and serve hot."
        ]
      },
      {
        "name": "Brik",
        "description": "A crispy pastry filled with egg and tuna.",
        "ingredients": [
          "4 sheets of brik or phyllo dough",
          "4 eggs",
          "1 can of tuna, drained",
          "1 onion, chopped",
          "1 tbsp capers",
          "1 tbsp chopped parsley",
          "1 tbsp olive oil",
          "Salt and pepper, to taste"
        ],
        "instructions": [
          "In a skillet, heat the olive oil over medium heat.",
          "Add the onion and sauté for 2-3 minutes, until soft.",
          "Add the tuna, capers, parsley, salt, and pepper, and cook for 2-3 minutes.",
          "Crack an egg into a small bowl and set aside.",
          "Place one sheet of brik on a flat surface and brush with a little olive oil.",
          "Place a tablespoon of the tuna mixture in the center of the sheet.",
          "Make a well in the center of the mixture and carefully pour the egg into it.",
          "Fold the corners of the sheet up to enclose the filling and create a square packet.",
          "Repeat with the remaining sheets of brik and filling.",
          "In a large skillet, heat about 1/2 inch of vegetable oil over medium-high heat.",
          "Fry each brik for 2-3 minutes on each side, or until golden brown and crispy.",
          "Drain on a paper towel-lined plate and serve hot."
        ]
      }
    ]
  },
  "American Samoa": {
    "recipes": [
      {
        "name": "Fa'ausi",
        "description": "A traditional Samoan dessert made with coconut milk and brown sugar.",
        "ingredients": [
          "1 can (13.5 oz) coconut milk",
          "1 cup brown sugar",
          "1/2 cup water",
          "1 teaspoon vanilla extract"
        ],
        "instructions": [
          "In a large saucepan, combine the coconut milk, brown sugar, and water.",
          "Bring to a boil over medium-high heat, stirring occasionally.",
          "Reduce heat to low and simmer for 20-25 minutes, or until the mixture thickens.",
          "Remove from heat and stir in the vanilla extract.",
          "Let cool for a few minutes before serving."
        ]
      },
      {
        "name": "Lu'au",
        "description": "A traditional Samoan dish made with taro leaves and coconut cream.",
        "ingredients": [
          "1 can (13.5 oz) coconut milk",
          "1/2 cup water",
          "2 pounds taro leaves",
          "1 onion, chopped",
          "1 teaspoon salt"
        ],
        "instructions": [
          "In a large pot, bring the coconut milk and water to a simmer over medium-high heat.",
          "Add the taro leaves, onion, and salt to the pot and stir gently to combine.",
          "Cover the pot and reduce heat to low. Simmer for 1-2 hours, or until the leaves are tender and the mixture has thickened.",
          "Serve hot, garnished with additional coconut cream if desired."
        ]
      },
      {
        "name": "Kokolo",
        "description": "A spicy Samoan dish made with fish, tomatoes, and chili peppers.",
        "ingredients": [
          "2 pounds fish fillets, cut into bite-sized pieces",
          "1 onion, chopped",
          "2 tomatoes, chopped",
          "2-3 chili peppers, chopped",
          "1/4 cup lemon juice",
          "1/4 cup coconut cream",
          "Salt and pepper, to taste"
        ],
        "instructions": [
          "In a large bowl, combine the fish, onion, tomatoes, and chili peppers.",
          "Add the lemon juice, coconut cream, salt, and pepper to the bowl and stir gently to combine.",
          "Cover the bowl and let marinate in the refrigerator for 1-2 hours.",
          "Preheat the oven to 350°F (175°C).",
          "Transfer the fish mixture to a baking dish and bake for 20-25 minutes, or until the fish is cooked through and the mixture is hot and bubbly.",
          "Serve hot."
        ]
      }
    ]
  },
  "Andorra": {
    "recipes": [
      {
        "name": "Trinxat",
        "description": "A traditional Andorran dish made with cabbage, potatoes, and bacon.",
        "ingredients": [
          "1 small cabbage, cored and chopped",
          "1 pound potatoes, peeled and chopped",
          "6 ounces bacon, diced",
          "2 cloves garlic, minced",
          "1/2 cup chicken broth",
          "Salt and pepper to taste",
          "2 tablespoons olive oil"
        ],
        "instructions": [
          "In a large pot of boiling salted water, cook the cabbage and potatoes for 15 minutes or until tender.",
          "Drain well and mash the vegetables until smooth.",
          "In a large skillet, cook the bacon until crisp.",
          "Add the garlic and cook for 1 minute.",
          "Add the mashed vegetables and chicken broth to the skillet and cook over medium heat until heated through.",
          "Season with salt and pepper to taste.",
          "Drizzle with olive oil before serving."
        ]
      },
      {
        "name": "Coca",
        "description": "A savory Andorran pastry made with a flaky crust and filled with meat, vegetables, and cheese.",
        "ingredients": [
          "2 cups all-purpose flour",
          "1/2 cup cold butter, cut into small pieces",
          "1/2 cup cold water",
          "1/2 teaspoon salt",
          "1/2 pound ground beef or pork",
          "1 onion, chopped",
          "1 red bell pepper, chopped",
          "1/2 cup frozen peas",
          "1/2 cup shredded cheese",
          "1 egg, beaten"
        ],
        "instructions": [
          "In a large bowl, combine the flour, butter, water, and salt. Mix until a dough forms.",
          "Wrap the dough in plastic wrap and chill for 30 minutes.",
          "In a large skillet, cook the ground meat until browned. Drain any excess fat.",
          "Add the onion and bell pepper to the skillet and cook until softened.",
          "Stir in the frozen peas and cook for 2-3 minutes.",
          "Roll out the dough on a floured surface and place it in a greased baking dish.",
          "Spread the meat and vegetable mixture over the dough, leaving a small border around the edges.",
          "Sprinkle the shredded cheese over the top of the filling.",
          "Fold the edges of the dough over the filling and brush with the beaten egg.",
          "Bake at 375°F for 35-40 minutes or until the crust is golden brown.",
          "Let cool for a few minutes before slicing and serving."
        ]
      }
    ]
  },
  "Angola": {
    "recipes": [
      {
        "name": "Calulu de Peixe",
        "description": "A traditional Angolan fish stew made with palm oil, okra, and spices.",
        "ingredients": [
          "2 lbs fish fillets (tilapia, cod, or other white fish), cut into pieces",
          "2 onions, chopped",
          "2 garlic cloves, minced",
          "2 tablespoons palm oil",
          "1 lb okra, sliced",
          "2 tomatoes, chopped",
          "2 cups water or fish stock",
          "1 teaspoon salt",
          "1 teaspoon black pepper",
          "1 teaspoon paprika",
          "1 bay leaf"
        ],
        "instructions": [
          "In a large pot, heat the palm oil over medium heat.",
          "Add the onions and garlic and cook until softened.",
          "Add the fish and cook until browned on all sides.",
          "Add the okra, tomatoes, water or fish stock, salt, black pepper, paprika, and bay leaf.",
          "Bring to a boil, then reduce heat to low and simmer for about 30 minutes, or until the fish is cooked through and the okra is tender.",
          "Serve hot over rice or with crusty bread."
        ]
      },
      {
        "name": "Muamba de Galinha",
        "description": "A spicy chicken stew made with peanut butter, vegetables, and spices.",
        "ingredients": [
          "2 lbs chicken pieces (legs, thighs, or breasts)",
          "2 onions, chopped",
          "2 garlic cloves, minced",
          "1/4 cup peanut butter",
          "2 tomatoes, chopped",
          "2 cups water or chicken stock",
          "2 tablespoons palm oil",
          "2 cups chopped vegetables (carrots, bell peppers, sweet potatoes, or others)",
          "1 teaspoon salt",
          "1 teaspoon black pepper",
          "1 teaspoon paprika",
          "1 bay leaf",
          "1/4 teaspoon cayenne pepper"
        ],
        "instructions": [
          "In a large pot, heat the palm oil over medium heat.",
          "Add the onions and garlic and cook until softened.",
          "Add the chicken and cook until browned on all sides.",
          "Add the peanut butter, tomatoes, water or chicken stock, chopped vegetables, salt, black pepper, paprika, bay leaf, and cayenne pepper.",
          "Bring to a boil, then reduce heat to low and simmer for about 30-40 minutes, or until the chicken is cooked through and the vegetables are tender.",
          "Serve hot over rice or with crusty bread."
        ]
      }
    ]
  },
  "Anguilla": {
    "recipes": [
      {
        "name": "Crayfish Stew",
        "description": "A delicious stew made with fresh crayfish and vegetables.",
        "ingredients": [
          "2 lbs crayfish",
          "2 onions, chopped",
          "2 tomatoes, chopped",
          "1 red bell pepper, chopped",
          "1 green bell pepper, chopped",
          "4 garlic cloves, minced",
          "1 tablespoon fresh thyme",
          "2 tablespoons vegetable oil",
          "2 cups water",
          "1 teaspoon salt",
          "1 teaspoon black pepper"
        ],
        "instructions": [
          "In a large pot, heat the oil over medium-high heat. Add the onions and cook until soft and translucent.",
          "Add the garlic, bell peppers, and tomatoes. Cook for a few minutes until the vegetables start to soften.",
          "Add the crayfish, thyme, salt, and black pepper. Stir to combine all the ingredients.",
          "Add the water and bring to a boil.",
          "Reduce the heat to low and simmer for about 15 minutes, or until the crayfish are cooked through.",
          "Serve hot with rice or bread."
        ]
      },
      {
        "name": "Johnny Cakes",
        "description": "A simple and delicious cornmeal flatbread.",
        "ingredients": [
          "2 cups yellow cornmeal",
          "1 teaspoon salt",
          "1 tablespoon sugar",
          "1 cup water",
          "1/4 cup vegetable oil"
        ],
        "instructions": [
          "In a large bowl, mix together the cornmeal, salt, and sugar.",
          "Add the water and stir until a dough forms.",
          "Knead the dough on a floured surface for a few minutes, until it becomes smooth and elastic.",
          "Divide the dough into 8 equal pieces and shape them into flat rounds.",
          "Heat the oil in a large skillet over medium-high heat.",
          "Fry the Johnny Cakes for a few minutes on each side, until they are golden brown and crispy.",
          "Serve hot."
        ]
      }
    ]
  },
  "Antigua and Barbuda": {
    "recipes": [
      {
        "name": "Fungee and Saltfish",
        "description": "A traditional Antiguan breakfast dish made with cornmeal and salt cod.",
        "ingredients": [
          "1 cup cornmeal",
          "1/2 teaspoon salt",
          "2 cups water",
          "1/2 pound salt cod, soaked overnight and shredded",
          "1 onion, chopped",
          "1/2 green bell pepper, chopped",
          "1/2 red bell pepper, chopped",
          "1 tablespoon vegetable oil",
          "1/4 teaspoon black pepper",
          "1/4 teaspoon hot pepper sauce"
        ],
        "instructions": [
          "In a large bowl, mix together the cornmeal, salt, and water.",
          "In a medium skillet, heat the oil over medium heat. Add the onion and peppers and cook until softened, about 5 minutes.",
          "Add the salt cod to the skillet and cook for another 5 minutes.",
          "Pour the cornmeal mixture into the skillet and stir to combine with the salt cod and vegetables.",
          "Cook over low heat, stirring frequently, for 15-20 minutes, or until the mixture has thickened and the cornmeal is cooked through.",
          "Serve hot with hot pepper sauce."
        ]
      },
      {
        "name": "Curried Goat",
        "description": "A flavorful Antiguan dish made with goat meat and spices.",
        "ingredients": [
          "2 pounds goat meat, cut into bite-size pieces",
          "1 onion, chopped",
          "2 garlic cloves, minced",
          "1 tablespoon curry powder",
          "1/2 teaspoon ground allspice",
          "1/2 teaspoon ground cinnamon",
          "1/2 teaspoon ground ginger",
          "1/4 teaspoon ground nutmeg",
          "1/4 teaspoon cayenne pepper",
          "2 cups water",
          "1 tablespoon vegetable oil",
          "1 teaspoon salt"
        ],
        "instructions": [
          "In a large pot, heat the oil over medium heat. Add the onion and garlic and cook until softened, about 5 minutes.",
          "Add the goat meat to the pot and cook until browned on all sides.",
          "Stir in the curry powder, allspice, cinnamon, ginger, nutmeg, and cayenne pepper.",
          "Add the water to the pot and bring to a boil.",
          "Reduce heat to low and simmer for 1-2 hours, or until the goat meat is tender and the sauce has thickened.",
          "Stir in the salt and serve hot with rice or bread."
        ]
      }
    ]
  },
  "Argentina": {
    "recipes": [
      {
        "name": "Empanadas",
        "description": "A savory pastry filled with seasoned ground beef, olives, onions, and spices.",
        "ingredients": [
          "1 pound ground beef",
          "1 onion, chopped",
          "1/2 cup pitted green olives, chopped",
          "1 tablespoon paprika",
          "1 teaspoon ground cumin",
          "1/2 teaspoon dried oregano",
          "Salt and pepper, to taste",
          "2 packages empanada dough rounds",
          "1 egg, beaten"
        ],
        "instructions": [
          "In a large skillet, cook the ground beef over medium heat until browned, breaking it up with a wooden spoon.",
          "Add the chopped onion and cook until softened.",
          "Stir in the chopped olives, paprika, cumin, oregano, salt, and pepper. Cook for an additional 5 minutes.",
          "Preheat the oven to 400°F (200°C).",
          "On a lightly floured surface, roll out the empanada dough rounds to about 5 inches in diameter.",
          "Place a spoonful of the beef filling in the center of each round.",
          "Fold the dough in half and pinch the edges together to seal.",
          "Brush the empanadas with the beaten egg.",
          "Bake for 15-20 minutes, or until golden brown."
        ]
      },
      {
        "name": "Milanesa",
        "description": "A breaded and fried beef cutlet similar to schnitzel.",
        "ingredients": [
          "4 beef cutlets, pounded thin",
          "1 cup breadcrumbs",
          "1/2 cup flour",
          "2 eggs, beaten",
          "1 teaspoon paprika",
          "Salt and pepper, to taste",
          "Vegetable oil, for frying"
        ],
        "instructions": [
          "Preheat the oven to 200°F (95°C).",
          "In a shallow dish, mix together the breadcrumbs, flour, paprika, salt, and pepper.",
          "Dip each beef cutlet into the beaten eggs, then coat with the breadcrumb mixture.",
          "Heat the vegetable oil in a large skillet over medium-high heat.",
          "Fry the cutlets for 3-4 minutes on each side, or until golden brown and crispy.",
          "Transfer the cutlets to a baking sheet and keep warm in the oven until ready to serve."
        ]
      }
    ]
  },
  "Armenia": {
    "recipes": [
      {
        "name": "Khorovats",
        "description": "Armenian grilled meat skewers",
        "ingredients": [
          "2 lbs boneless beef or pork",
          "2 onions, chopped",
          "1/4 cup olive oil",
          "1/4 cup vinegar",
          "1 tsp salt",
          "1 tsp black pepper",
          "1 tsp paprika",
          "1 tsp garlic powder"
        ],
        "instructions": [
          "Cut meat into 1 inch cubes.",
          "In a large bowl, combine meat, onions, olive oil, vinegar, salt, black pepper, paprika, and garlic powder. Mix well and let marinate in the fridge for at least 2 hours.",
          "Preheat grill to medium-high heat.",
          "Thread meat onto skewers.",
          "Grill skewers for 10-15 minutes, turning occasionally, or until meat is cooked through.",
          "Serve hot with pita bread, sliced tomatoes, and cucumbers."
        ]
      },
      {
        "name": "Lavash",
        "description": "Traditional Armenian flatbread",
        "ingredients": [
          "4 cups all-purpose flour",
          "1 tsp salt",
          "1 tsp sugar",
          "1 tsp active dry yeast",
          "1 1/2 cups warm water"
        ],
        "instructions": [
          "In a large bowl, whisk together flour, salt, sugar, and yeast.",
          "Gradually add warm water and stir until a dough forms.",
          "Knead dough on a lightly floured surface for 5-10 minutes, or until smooth and elastic.",
          "Place dough in a lightly oiled bowl and cover with a towel. Let rise in a warm place for 1-2 hours, or until doubled in size.",
          "Preheat oven to 500°F.",
          "Divide dough into 8-10 pieces and roll each piece into a thin circle on a lightly floured surface.",
          "Place circles of dough onto a baking sheet and bake for 3-5 minutes, or until bread is puffed and lightly browned.",
          "Remove from oven and let cool on a wire rack.",
          "Serve with hummus, baba ganoush, or any other dip."
        ]
      }
    ]
  },
  "Aruba": {
    "recipes": [
      {
        "name": "Keshi Yena",
        "description": "A popular Aruban dish made with chicken, cheese, and other ingredients.",
        "ingredients": [
          "1 whole chicken, cooked and shredded",
          "1 onion, chopped",
          "1 green bell pepper, chopped",
          "1 red bell pepper, chopped",
          "3 cloves garlic, minced",
          "1 tablespoon tomato paste",
          "1 tablespoon Worcestershire sauce",
          "1/2 cup ketchup",
          "1/2 cup raisins",
          "1/2 cup pimento-stuffed olives",
          "1 cup bread crumbs",
          "1 cup shredded Gouda cheese",
          "1/2 cup milk",
          "Salt and pepper, to taste"
        ],
        "instructions": [
          "Preheat the oven to 375°F.",
          "In a large pan, sauté the onion, bell peppers, and garlic until tender.",
          "Add the tomato paste, Worcestershire sauce, ketchup, raisins, and olives. Stir to combine.",
          "Add the cooked chicken and stir to combine.",
          "Season with salt and pepper, to taste.",
          "In a separate bowl, mix together the bread crumbs, shredded cheese, and milk.",
          "Grease a baking dish with butter or oil.",
          "Layer the chicken mixture and bread crumb mixture in the baking dish, starting with a layer of chicken and ending with a layer of bread crumbs.",
          "Bake for 30-35 minutes, or until the bread crumbs are golden brown and the cheese is melted and bubbly.",
          "Serve hot."
        ]
      },
      {
        "name": "Pastechi",
        "description": "A traditional Aruban snack made with dough filled with cheese or meat.",
        "ingredients": [
          "2 cups flour",
          "1/2 teaspoon salt",
          "1 tablespoon sugar",
          "1/2 cup cold butter, cut into small pieces",
          "1/2 cup cold water",
          "1 egg, beaten",
          "1/2 pound gouda cheese or ground beef"
        ],
        "instructions": [
          "In a large mixing bowl, whisk together the flour, salt, and sugar.",
          "Using a pastry blender or your fingers, cut in the butter until the mixture resembles coarse crumbs.",
          "Add the water, a little at a time, until the dough comes together and forms a ball.",
          "Cover the dough and let it rest in the refrigerator for at least 30 minutes.",
          "Preheat the oven to 350°F (175°C).",
          "On a floured surface, roll out the dough to 1/8 inch thickness.",
          "Using a circular cookie cutter or a glass, cut out circles of dough.",
          "Place a tablespoon of grated gouda cheese or a spoonful of ground beef in the center of each circle.",
          "Fold the dough over the filling to form a half-moon shape and press the edges together to seal.",
          "Brush the pastechi with beaten egg and place them on a baking sheet.",
          "Bake for 20-25 minutes, or until golden brown.",
          "Serve hot."
        ]
      }
    ]
  },
  "Australia": {
    "recipes": [
      {
        "name": "Meat Pie",
        "description": "A classic Australian dish consisting of a pastry shell filled with savory minced meat.",
        "ingredients": [
          "1 pound ground beef",
          "1 onion, chopped",
          "2 garlic cloves, minced",
          "1 tablespoon tomato paste",
          "1 tablespoon Worcestershire sauce",
          "1 tablespoon all-purpose flour",
          "1/2 teaspoon dried thyme",
          "1/2 teaspoon dried rosemary",
          "1/2 teaspoon salt",
          "1/4 teaspoon black pepper",
          "1 cup beef broth",
          "1 sheet puff pastry, thawed",
          "1 egg, beaten"
        ],
        "instructions": [
          "Preheat the oven to 400°F.",
          "In a large skillet, cook the ground beef over medium heat until browned.",
          "Add the onion and garlic and cook until softened.",
          "Stir in the tomato paste, Worcestershire sauce, flour, thyme, rosemary, salt, and black pepper.",
          "Gradually stir in the beef broth and bring to a simmer. Cook for 5-10 minutes or until the mixture has thickened.",
          "Roll out the puff pastry sheet on a lightly floured surface and cut it into 4 equal squares.",
          "Divide the meat mixture among the squares, placing it in the center of each one.",
          "Fold the pastry over the filling to create a triangle shape, pressing the edges to seal.",
          "Brush the tops of the pies with the beaten egg and cut a small slit in the center of each one to allow steam to escape.",
          "Bake for 20-25 minutes or until the pastry is golden brown and puffed up.",
          "Serve hot."
        ]
      },
      {
        "name": "Lamingtons",
        "description": "A classic Australian dessert consisting of sponge cake coated in chocolate and coconut.",
        "ingredients": [
          "1/2 cup unsalted butter, softened",
          "1 cup granulated sugar",
          "4 large eggs",
          "2 cups all-purpose flour",
          "2 teaspoons baking powder",
          "1/2 teaspoon salt",
          "1/2 cup milk",
          "1 teaspoon vanilla extract",
          "4 cups powdered sugar",
          "1/2 cup unsweetened cocoa powder",
          "1/2 cup hot water",
          "1/2 cup unsweetened shredded coconut"
        ],
        "instructions": [
          "Preheat oven to 350°F (180°C). Grease and flour a 9x13-inch baking pan.",
          "In a large bowl, cream the butter and granulated sugar until light and fluffy.",
          "Beat in the eggs one at a time, mixing well after each addition.",
          "In a separate bowl, whisk together the flour, baking powder, and salt.",
          "Gradually add the flour mixture to the butter mixture, alternating with the milk, until the batter is smooth and well combined.",
          "Stir in the vanilla extract.",
          "Pour the batter into the prepared pan and smooth the top with a spatula.",
          "Bake for 25-30 minutes, or until a toothpick inserted into the center of the cake comes out clean.",
          "Let the cake cool completely in the pan before cutting into 24 squares.",
          "In a medium bowl, whisk together the powdered sugar, cocoa powder, and hot water until smooth.",
          "Place the shredded coconut in a shallow dish.",
          "Dip each square of cake into the chocolate mixture, using a fork to turn it over and coat all sides.",
          "Use the fork to lift the cake out of the chocolate and let any excess drip off.",
          "Roll the cake in the shredded coconut until well coated.",
          "Place the finished lamingtons on a wire rack to set.",
          "Serve at room temperature."
        ]
      }
    ]
  },
  "Austria": {
    "recipes": [
      {
        "name": "Wiener Schnitzel",
        "description": "A classic Austrian dish consisting of breaded and fried veal cutlets.",
        "ingredients": [
          "4 veal cutlets",
          "1 cup breadcrumbs",
          "1/2 cup all-purpose flour",
          "2 eggs, beaten",
          "Salt and pepper, to taste",
          "1/2 cup vegetable oil"
        ],
        "instructions": [
          "Pound the veal cutlets to an even thickness, about 1/4 inch.",
          "Season the cutlets with salt and pepper.",
          "Place the flour in a shallow dish, the beaten eggs in another dish, and the breadcrumbs in a third dish.",
          "Dredge each cutlet in the flour, shaking off any excess, then dip in the egg, and coat with breadcrumbs.",
          "Heat the oil in a large skillet over medium-high heat.",
          "Add the cutlets and cook until golden brown and cooked through, about 3-4 minutes per side.",
          "Drain on a paper towel-lined plate and serve hot with lemon wedges."
        ]
      },
      {
        "name": "Apfelstrudel",
        "description": "A sweet Austrian pastry filled with apples, cinnamon, and raisins.",
        "ingredients": [
          "1/2 cup unsalted butter, melted",
          "1/2 cup breadcrumbs",
          "1/2 cup granulated sugar",
          "1 teaspoon ground cinnamon",
          "3 large apples, peeled, cored, and thinly sliced",
          "1/2 cup raisins",
          "1/2 cup slivered almonds",
          "8 sheets phyllo dough",
          "1/4 cup unsalted butter, melted"
        ],
        "instructions": [
          "Preheat oven to 375°F. Line a baking sheet with parchment paper.",
          "Mix together the breadcrumbs, sugar, and cinnamon in a small bowl.",
          "In a large bowl, toss the sliced apples with the breadcrumb mixture, raisins, and slivered almonds.",
          "Lay one sheet of phyllo dough on a clean work surface and brush with melted butter. Repeat with remaining phyllo sheets.",
          "Spread the apple mixture over the phyllo stack, leaving a 2-inch border on all sides.",
          "Fold the edges of the phyllo over the filling and roll up tightly.",
          "Transfer the strudel to the prepared baking sheet, seam side down.",
          "Brush the top of the strudel with melted butter and bake for 30-35 minutes, or until golden brown and crispy.",
          "Let cool for a few minutes before slicing and serving."
        ]
      }
    ]
  },
  "Azerbaijan": {
    "recipes": [
      {
        "name": "Plov",
        "description": "Azerbaijani version of pilaf made with lamb or beef, rice, and vegetables.",
        "ingredients": [
          "1 pound lamb or beef, cubed",
          "2 cups rice",
          "2 onions, chopped",
          "2 carrots, peeled and grated",
          "1/2 cup vegetable oil",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1 teaspoon paprika",
          "1 teaspoon salt",
          "4 cups water"
        ],
        "instructions": [
          "In a large pot, heat the oil over medium heat. Add the onions and cook until translucent.",
          "Add the meat and cook until browned on all sides.",
          "Add the rice, grated carrots, cumin, coriander, paprika, and salt. Stir to combine.",
          "Add the water and bring to a boil.",
          "Reduce heat to low and cover the pot. Simmer for 20-25 minutes, or until the rice is tender and the liquid has been absorbed.",
          "Serve hot."
        ]
      },
      {
        "name": "Dolma",
        "description": "Azerbaijani dish made of stuffed grape leaves or vegetables, typically with a mixture of rice and meat.",
        "ingredients": [
          "1 pound ground lamb or beef",
          "1 onion, chopped",
          "1/2 cup rice",
          "1/4 cup fresh parsley, chopped",
          "1/4 cup fresh mint, chopped",
          "1/4 cup fresh dill, chopped",
          "1/2 teaspoon salt",
          "1/4 teaspoon black pepper",
          "1/2 cup vegetable oil",
          "1 jar preserved grape leaves, drained and rinsed",
          "4 cups water"
        ],
        "instructions": [
          "In a large bowl, mix together the ground meat, onion, rice, parsley, mint, dill, salt, and pepper.",
          "Gently separate the grape leaves and rinse them under cold water.",
          "Place a grape leaf on a flat surface, shiny side down, with the stem facing you.",
          "Place a tablespoon of the meat mixture near the stem of the grape leaf.",
          "Fold the bottom of the leaf over the filling, then fold in the sides, and roll up tightly to form a small packet.",
          "Repeat with the remaining grape leaves and filling.",
          "In a large pot, arrange the dolmas in a single layer.",
          "Add the water and enough oil to cover the dolmas.",
          "Place a plate or lid on top of the dolmas to weigh them down.",
          "Bring the water to a boil over medium-high heat.",
          "Reduce heat to low and simmer for 30-40 minutes, or until the rice and meat are cooked through and the grape leaves are tender.",
          "Remove from heat and let cool for a few minutes before serving."
        ]
      }
    ]
  }
}
